import { Typography, Link } from '@material-ui/core';
import styles from 'styles/GDPR.module.scss';

const GDPR = () => (
    <>
        <Typography className={styles.text}>
            Ученическият хакатон на Технологично училище “Електронни системи”
            (наричано по-долу ТУЕС) към Технически университет - София, Hack
            TUES, се организира от екип ученици-доброволци от 11. клас под
            менторството на Асоциацията на завършилите ТУЕС и с подкрепата на
            ръководството на училището.
        </Typography>
        <Typography className={styles.text}>
            “Асоциация на завършилите ТУЕС” (наричана по-долу АЗТУЕС,
            Асоциацията) е сдружение с нестопанска цел за осъществяване на
            общественополезна дейност със седалище и адрес на управление: ул.
            Владимир Пашов 2, София, България. Основната цел на АЗТУЕС е да
            обедини и подпомага общността от завършили и настоящи ученици в
            <Link
                href='https://elsys-bg.org/'
                rel='noopener noreferrer'
                target='_blank'
            >
                Технологично училище "Електронни системи" към ТУ - София
            </Link>{' '}
            (ТУЕС) , преподаватели и приятели на училището.
        </Typography>
        <Typography className={styles.text}>
            Целта на настоящата политика за поверителност е да опише как
            Асоциацията, в качеството си на{' '}
            <strong>администратор на лични данни</strong>, събира, съхранява и
            използва информация за кандидатите и участниците в Hack TUES 6, за
            лицата, посещаващи уебсайта на събитието, както и да предостави
            информация за техните права съгласно Закона за защита на личните
            данни и Регламент (ЕС) 2016/679 на Европейския парламент и на Съвета
            от 27 април 2016 година относно защитата на физическите лица във
            връзка с обработването на лични данни и относно свободното движение
            на такива данни и за отмяна на Директива 95/46/EО (Общ регламент
            относно защитата на данните).
        </Typography>
        <Typography className={`${styles.text} ${styles.heading}`} variant='h5'>
            Какви лични данни събираме и за какви цели?
        </Typography>
        <Typography className={styles.text}>
            Всеки ученик от ТУЕС, който иска да участва в хакатона Hack TUES 6,
            трябва да се регистрира, предоставяйки следната информация:
            <Typography className={styles.text} component='ul'>
                <Typography className={styles.text} component='li'>
                    имейл адрес;
                </Typography>
                <Typography className={styles.text} component='li'>
                    име и фамилия;
                </Typography>
                <Typography className={styles.text} component='li'>
                    клас и паралелка в ТУЕС;
                </Typography>
                <Typography className={styles.text} component='li'>
                    потребителско име;
                </Typography>
                <Typography className={styles.text} component='li'>
                    размер на тениска;
                </Typography>
                <Typography className={styles.text} component='li'>
                    хранителни предпочитания (дали участникът е вегетарианец) и
                    алергии.
                </Typography>
            </Typography>
        </Typography>
        <Typography className={styles.text}>
            Имейл адресът е необходим за контакт с кандидата/участника за
            хакатона, за да можем да му/й изпращаме важна информация, свързана с
            провеждането на събитието и да може да комуникира с останалите
            кандидат-участници за хакатона в процеса на сформиране на отбор.
            Когато капитан на определен отбор покани ученик да се включи в
            отбора му или когато ученик изпрати покана за включване в даден
            отбор, заедно с поканата се изпраща имейла на ученика, за да може да
            има връзка между капитан на отбор и потенциалния нов участник в
            него.
        </Typography>
        <Typography className={styles.text}>
            Име, фамилия, клас, паралелка и потребителско име на
            кандидата/участника се използват, за да може да се идентифицира -
            както от организаторите, така и от други участници в хакатона, които
            биха искали да го добавят ученика в своя отбор.
        </Typography>
        <Typography className={styles.text}>
            Сайтът съдържа публичен списък с всички отбори. Когато един ученик е
            включен в даден отбор, изброените по-горе данни (име, фамилия, клас,
            паралелка и потребителско име) стават публични за всички посетители
            на сайта. Публичната информация за отбора включва също:
            <Typography className={styles.text} component='ul'>
                <Typography className={styles.text} component='li'>
                    технологии, които отборът използва за реализация на проекта
                    си;
                </Typography>
                <Typography className={styles.text} component='li'>
                    име на проекта;
                </Typography>
                <Typography className={styles.text} component='li'>
                    описание на проекта;
                </Typography>
                <Typography className={styles.text} component='li'>
                    линк към GitHub хранилище.
                </Typography>
            </Typography>
            Целта на публичния списък е да улесним достъпа на менторите и
            представителите на медиите, които отразяват хакатона до описанието
            на различните проекти и участниците, които ги разработват.
        </Typography>
        <Typography className={styles.text}>
            Информацията за размер на тениска и хранителни предпочитания/алергии
            е достъпна единствено и само за организаторите на събитието и се
            използва, за да може да се осигури за всеки участник тениска с
            подходящ размер и храна, която отговаря на неговите/нейните
            хранителни предпочитания и нужди.
        </Typography>
        <Typography className={styles.text}>
            Информацията от профилите на всеки кандидат и участник в Hack TUES 6
            събираме и обработваме на основание на неговото/нейното информирано
            съгласие. Кандидатите, които не предоставят необходимата за
            регистрация информация, няма как да участват в събитието.
        </Typography>
        <Typography className={styles.text}>
            Уебсайтът на ТУЕС използва също бисквитки с цел подобряване на
            потребителското преживяване. Повече можете да прочетете в политиката
            за бисквитките.
        </Typography>
        <Typography className={`${styles.text} ${styles.heading}`} variant='h5'>
            С кого и как можем да споделим ваши лични данни?
        </Typography>
        <Typography className={styles.text}>
            Информацията за отборите, участващи в хакатона е достъпна за всички
            посетители на сайта. На сайта на хакатона се публикува и класация на
            отборите във всеки от трите полуфинала и във финала на събитието.
            Информация за участниците, спечелили отличия на хакатона се
            публикува също в блога на ТУЕС и АЗТУЕС.
        </Typography>
        <Typography className={styles.text}>
            В допълнение информация за участниците в хакатона, включително
            спечелени отличия и награди по време на събитието се предоставя на
            ръководството и администрацията на ТУЕС с цел водене на статистика и
            поощряване на отличилите се ученици.
        </Typography>
        <Typography className={`${styles.text} ${styles.heading}`} variant='h5'>
            Колко дълго ги пазим?
        </Typography>
        <Typography className={styles.text}>
            Списък с отборите и тяхното описание обикновено остават публични в
            сайта до смяната му с нова версия за следващото издание на хакатона
            (февруари 2021). Асоциацията пази информация за участниците в
            хакатона до завършването им със статистически цели.
        </Typography>
        <Typography className={`${styles.text} ${styles.heading}`} variant='h5'>
            Данни на непълнолетни участници в Hack TUES 6
        </Typography>
        <Typography className={styles.text}>
            Тъй като по-голямата част от участниците в хакатона Hack TUES са
            непълнолетни, всеки участник, който иска да бъде допуснат до
            събитието, трябва да предостави декларация, подписана от негов
            родител или настойник, че е запознат с участието на ученика в
            събитието и начина, по който съхраняваме и обработваме
            неговите/нейните лични данни, включително съгласие или отказ
            ученикът да бъде сниман по време на хакатона.
        </Typography>
        <Typography className={`${styles.text} ${styles.heading}`} variant='h5'>
            Данни на непълнолетни участници в Hack TUES 6
        </Typography>
        <Typography className={styles.text}>
            Всеки ученик, който се е регистрирал в сайта на Hack TUES 6 има
            следните права по отношение на неговите/нейните лични данни, които
            ние обработваме:
            <Typography className={styles.text} component='ol'>
                <Typography className={styles.text} component='li'>
                    <u>Право на достъп до Вашите личните данни</u>, които ние
                    обработваме и копие от тях.
                </Typography>
                <Typography className={styles.text} component='li'>
                    <u>Право на корекция в данните</u>, които обработваме, ако
                    откриете, че са неточни.
                </Typography>
                <Typography className={styles.text} component='li'>
                    <u>Право на заличаване на личните данни</u>, когато са
                    налице условията за това. Ако например сте оттеглили
                    съгласието си, когато обработката се основава на съгласие и
                    няма друго законово основание за обработка; ако данните Ви
                    се обработват незаконосъобразно и др.
                </Typography>
                <Typography className={styles.text} component='li'>
                    <u>Право на ограничаване в обработването</u> в определените
                    от закона случаи.
                </Typography>
                <Typography className={styles.text} component='li'>
                    <u>Право на възражение срещу обработването на данните</u> в
                    определени ситуации, като например в случаите, когато
                    данните Ви се използват на основание на легитимен интерес.
                </Typography>
                <Typography className={styles.text} component='li'>
                    <u>Право на преносимост на данните</u> - можете да изискате
                    от нас данните Ви да бъдат предоставени в структуриран,
                    машинночетим формат.
                </Typography>
                <Typography className={styles.text} component='li'>
                    <u>Право да оттеглите съгласието си</u>, когато личните Ви
                    данни се обработват на това основание.
                </Typography>
                <Typography className={styles.text} component='li'>
                    <u>Право да подадете жалба</u> до Комисията за защита на
                    личните данни по отношение на обработката на личните Ви
                    данни.
                </Typography>
            </Typography>
        </Typography>
        <Typography className={styles.text}>
            Можете да упражните правата си по всяко време през уебсайта на Hack
            TUES 6 и/или като се свържете с нас по имейл. Ще се постараем да
            отговорим възможно най-бързо и не по-късно от 30 работни дни.
        </Typography>
        <Typography className={`${styles.text} ${styles.heading}`} variant='h5'>
            Контакт с нас
        </Typography>
        <Typography className={styles.text}>
            При въпроси свързани с обработката на личните Ви данни, можете да се
            свържете с нас по имейл:{' '}
            <Link
                href='mailto:hacktues@elsys-bg.org'
                rel='noopener noreferrer'
                target='_blank'
            >
                hacktues@elsys-bg.org
            </Link>
        </Typography>
    </>
);

export default GDPR;
